designDocs/report/test_ut.tex
% Created 2019-04-16 Tue 12:20
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[table]{xcolor}
\usepackage{longtable}
\author{Shath Ibrahim}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Shath Ibrahim},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\section{Unit Test}
\label{sec:org7bfdc9e}
Unit test 1


\begin{longtable}{|p{6in}|}
\hline 
\textbf{Unit Test Plan} \cellcolor{blue!25} \\  
\hline 
\endfirsthead 
\multicolumn{1}{l}{Continued from previous page} \\ 
\hline 

\textbf{Unit Test Plan} \cellcolor{blue!25} \\  \\ 
\hline 
\endhead 
\hline\multicolumn{1}{r}{Continued on next page} \ 
\endfoot 
\endlastfoot 
\hline 

 \hline
\textbf{Module Name: } SampleLoader \hspace{1in} \textbf{File:}\path{./test/path_test.py} \\ \hline
\textbf{1. Module Overview}\\\hline
The purpose of the SampleLoader is to aid the SampleController load the Sample
files from the directory. Inspite of it's name the actual responsibility  of
the class is to resolve the directory path of of a sample folder and nothing else.\\\hline
\textbf{1.1 Inpself to Module}\\\hline
Input 'param1' will passed as argument 1 of the constructor. 
 sys = SampleLoader(param1) \\\hline
\textbf{1.2 Output from Module}\\\hline
\\\hline
\textbf{1.3 Logic Flow}\\\hline
 
\begin{minted}{python}
  class SampleLoader(object):
    """ SampleLoader is responsible for aiding the load process of individual
    sample data from our directory.
    """

    def __init__(self, filename):
        #self._dir = "./data/"+filename+"/"
        f = filename
        if f[-1] != '/':
            f = f + "/"
        self._dir = f

    def getVideoFile(self):
        return self._dir+"test.avi"

    def getDir(self):
        return self._dir
\end{minted}
\\\hline
\textbf{2. Test Data}\\\hline

\begin{itemize}
  \item \path{./data/test/}
  \item \path{./data/test/}
\end{itemize}
\\\hline
\textbf{2.1 Positive Test Cases}\\\hline

\begin{itemize}
 \item CASE 1: testGetDir()           
 \item CASE 2: testGetVideoFile() 
 \item CASE 3: testDirSlash()     
\end{itemize}l
\\\hline
\textbf{2.2 Negative Test Cases}\\\hline
None\\\hline
\textbf{2.2 Interface Modules}\\\hline
Python unittest\\\hline
\textbf{2.3 Test Tools}\\\hline
Test Tools\\ 
\hline
\end{longtable}
\end{document}
